dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_udb_sdio.c
/*******************************************************************************
* File Name: cy_hal_udb_sdio.c
*
* Description:
* Provides a high level interface for interacting with the Cypress UDB SDIO.
* This is a wrapper around the lower level UDB SDIO API.
*
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


#include "cy_hal_hwmgr.h"

#if defined(CY8C6247BZI_D54) /* TODO: BSP-525 */

#include <stdlib.h>
#include "cy_hal_sdio.h"
#include "cy_hal_gpio.h"
#include "cy_hal_interconnect.h"
#include "SDIO_HOST_cfg.h"

/* Not connected pin define */
#define SDIO_PINS_NC    ((cy_gpio_t) CY_NC_PIN_VALUE)

/* The 64b block transition mode define */
#define CY_HAL_SDIO_64B      (64u)

/* The 1 byte transition mode define */
#define CY_HAL_SDIO_1B        (1u)

/*******************************************************************************
*       Configuration structures for SDIO pins
*******************************************************************************/
const cy_stc_gpio_pin_config_t pin_cmd_config = 
{
    .outVal = 1,
    .driveMode = CY_GPIO_DM_STRONG,
    .hsiom = P2_4_DSI_DSI, /* DSI controls 'out' and 'output enable' */
    .intEdge = CY_GPIO_INTR_DISABLE,
    .intMask = 0UL,
    .vtrip = CY_GPIO_VTRIP_CMOS,
    .slewRate = CY_GPIO_SLEW_FAST,
    .driveSel = CY_GPIO_DRIVE_1_2,
    .vregEn = 0UL,
    .ibufMode = 0UL,
    .vtripSel = 0UL,
    .vrefSel = 0UL,
    .vohSel = 0UL,
};

const cy_stc_gpio_pin_config_t pin_data_config = 
{
    .outVal = 1,
    .driveMode = CY_GPIO_DM_STRONG,
    .hsiom = P2_0_DSI_DSI, /* DSI controls 'out' and 'output enable' */
    .intEdge = CY_GPIO_INTR_DISABLE,
    .intMask = 0UL,
    .vtrip = CY_GPIO_VTRIP_CMOS,
    .slewRate = CY_GPIO_SLEW_FAST,
    .driveSel = CY_GPIO_DRIVE_1_2,
    .vregEn = 0UL,
    .ibufMode = 0UL,
    .vtripSel = 0UL,
    .vrefSel = 0UL,
    .vohSel = 0UL,
};

const cy_stc_gpio_pin_config_t pin_clk_config = 
{
    .outVal = 1,
    .driveMode = CY_GPIO_DM_STRONG_IN_OFF,
    .hsiom = P2_5_DSI_GPIO, /* DSI controls 'out', GPIO controls 'output enable' */
    .intEdge = CY_GPIO_INTR_DISABLE,
    .intMask = 0UL,
    .vtrip = CY_GPIO_VTRIP_CMOS,
    .slewRate = CY_GPIO_SLEW_FAST,
    .driveSel = CY_GPIO_DRIVE_1_2,
    .vregEn = 0UL,
    .ibufMode = 0UL,
    .vtripSel = 0UL,
    .vrefSel = 0UL,
    .vohSel = 0UL,
};

/* Callback pointers */
static cy_sdio_irq_handler cy_hal_sdio_callback = NULL;
static cy_sdio_t *cy_hal_sdio_config_struct = NULL;
static void *cy_hal_sdio_callback_args = NULL;


/*******************************************************************************
*       Dispatcher Interrupt Callbacks Service Routine
*******************************************************************************/
static void cy_sdio_interrupts_dispatcher_IRQHandler(void)
{
    if (cy_hal_sdio_callback != NULL)
    {
        (void)(cy_hal_sdio_callback)(cy_hal_sdio_callback_args, (cy_sdio_irq_event_t) cy_hal_sdio_config_struct->irqCause);
    }
}


/*******************************************************************************
*       Internal functions
*******************************************************************************/
static cy_rslt_t cy_free_pins(cy_sdio_t *obj);

static cy_rslt_t cy_free_pins(cy_sdio_t *obj)
{
    cy_rslt_t retVal = CY_RSC_INVALID;

    retVal = cy_gpio_free(obj->pin_clk);
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_gpio_free(obj->pin_cmd);
    }

    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_gpio_free(obj->pin_data0);
    }
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_gpio_free(obj->pin_data1);
    }
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_gpio_free(obj->pin_data2);
    }
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_gpio_free(obj->pin_data3);
    }

    return retVal;
}

static cy_rslt_t cy_free_clocks(cy_sdio_t *obj)
{
    cy_rslt_t retVal;

    /* Free clock divider resource*/
    cy_resource_inst_t udbClkRsc;
    
    udbClkRsc.type = CY_RSC_CLOCK;
    udbClkRsc.block_num = obj->clock.div_num;
    udbClkRsc.channel_num = 0;

    retVal = cy_hwmgr_set_unconfigured(udbClkRsc.type, udbClkRsc.block_num, udbClkRsc.channel_num);
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_hwmgr_free(&udbClkRsc);
    }

    return retVal;
}


static cy_rslt_t cy_free_dmas(cy_sdio_t *obj)
{
    cy_rslt_t retVal;

    /* Free clock divider resource*/
    cy_resource_inst_t dmaRsc;
    
    dmaRsc.type = CY_RSC_DMA;
    
    /* Release DMA0 CH0 */
    dmaRsc.block_num = 0;
    dmaRsc.channel_num = 0;

    retVal = cy_hwmgr_set_unconfigured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_hwmgr_free(&dmaRsc);
    }
    
    /* Release DMA0 CH1 */
    dmaRsc.block_num = 0;
    dmaRsc.channel_num = 1;

    retVal = cy_hwmgr_set_unconfigured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_hwmgr_free(&dmaRsc);
    }
    
    /* Release DMA1 CH1 */
    dmaRsc.block_num = 1;
    dmaRsc.channel_num = 1;

    retVal = cy_hwmgr_set_unconfigured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_hwmgr_free(&dmaRsc);
    }

