dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_udb_sdio.c
    /* Release DMA1 CH1 */
    dmaRsc.block_num = 1;
    dmaRsc.channel_num = 3;

    retVal = cy_hwmgr_set_unconfigured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_hwmgr_free(&dmaRsc);
    }
    
    return retVal;
}


/** Initialize the SDIO peripheral
 *
 * @param[out] obj               The SDIO object
 * @param[out] clk               The pin connected to the clk signal
 * @param[in]  cmd               The pin connected to the command signal
 * @param[in]  data0             The pin connected to the data0 signal
 * @param[in]  data1             The pin connected to the data1 signal
 * @param[in]  data2             The pin connected to the data2 signal
 * @param[in]  data3             The pin connected to the data3 signal
 * @return The status of the init request
 */
cy_rslt_t cy_sdio_init(cy_sdio_t *obj, cy_gpio_t cmd, cy_gpio_t clk, cy_gpio_t data0, cy_gpio_t data1, cy_gpio_t data2, cy_gpio_t data3)
{
    bool isConfigured = false;
    cy_rslt_t retVal = CY_RSLT_SUCCESS;

    if(NULL == obj)
    {
        return CY_RSLT_SDIO_BAD_PARAM_ARGUMENT;
    }
    
    memset(obj, 0, sizeof(cy_sdio_t));
    
    /* If something go wrong, any resource not marked as invalid will be freed.
    *  Explicitly marked not allocated resources as invalid to prevent freeing 
    *  them.
    * 
    *  Before we reserve UDB at all we need try to reserve clock divider, then 
    *  DMAs and pins. If all these resources are reserved only then reserve UDB 
    *  SDIO.
    */
    obj->resource.type = CY_RSC_INVALID;
    obj->pin_cmd = SDIO_PINS_NC;
    obj->pin_clk = SDIO_PINS_NC;
    obj->pin_data0 = SDIO_PINS_NC;
    obj->pin_data1 = SDIO_PINS_NC;
    obj->pin_data2 = SDIO_PINS_NC;
    obj->pin_data3 = SDIO_PINS_NC;

    /* Reserve clock */
    cy_resource_inst_t udbClkRsc = { CY_RSC_CLOCK, 0, 0 };
    retVal = cy_hwmgr_reserve(&udbClkRsc);
    if (retVal == CY_RSLT_SUCCESS)
    {
        /* Check is the clock divider 0 configured */
        retVal = 
        cy_hwmgr_is_configured(udbClkRsc.type, udbClkRsc.block_num, udbClkRsc.channel_num, &isConfigured);

        /* UDB SDIO uses hard-coded clock divider 0 */
        if (retVal == CY_RSLT_SUCCESS && !isConfigured)
        {
            /* Assign clock divider */
            cy_en_sysclk_status_t clockAssignResult;

            obj->clock.div_type = CY_SYSCLK_DIV_8_BIT;
            obj->clock.div_num = 0;
           
            clockAssignResult = Cy_SysClk_PeriphSetDivider(obj->clock.div_type, obj->clock.div_num, 0U);
            
            if (CY_SYSCLK_SUCCESS == clockAssignResult)
            {
                clockAssignResult = Cy_SysClk_PeriphEnableDivider(obj->clock.div_type, obj->clock.div_num); 
            }
            
            if (CY_SYSCLK_SUCCESS == clockAssignResult)
            {
                clockAssignResult = Cy_SysClk_PeriphAssignDivider(PCLK_UDB_CLOCKS0, obj->clock.div_type, obj->clock.div_num);
            }

            retVal = (clockAssignResult == CY_SYSCLK_SUCCESS) 
                      ? CY_RSLT_SUCCESS
                      : CY_RSLT_SDIO_CLOCK_ERROR;

            /* Update object with reserved clock info */

            cy_hwmgr_set_configured(udbClkRsc.type, udbClkRsc.block_num, udbClkRsc.channel_num);
        }
    }

    /* The DMAs are initialized in SDIO_Init() function, so reserve DMA only */
    if (retVal == CY_RSLT_SUCCESS)
    {
        /* Reserve DMA0 CH0 */
        cy_resource_inst_t dmaRsc = { CY_RSC_DMA, 0, 0 };
        retVal = cy_hwmgr_reserve(&dmaRsc);

        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num, &isConfigured);

            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                //cy_dma_t udbDma0Ch0 = {TODO fill when is ready};

                /* Update obj info related to DMA */
                //obj->dma0Ch0.param1 = udbDma0Ch0.param1;
                //obj->dma0ChX.paramX = udbDma0Ch0.paramX;
                cy_hwmgr_set_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
            }
        }
    }

    if (retVal == CY_RSLT_SUCCESS)
    {
        /* Reserve DMA0 CH1 */
        cy_resource_inst_t dmaRsc = { CY_RSC_DMA, 0, 1 };

        retVal = cy_hwmgr_reserve(&dmaRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num, &isConfigured);

            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                //cy_dma_t udbDma0Ch1 = {TODO fill when is ready};

                /* Update obj info related to DMA */
                //obj->dma0Ch1.param1 = udbDma0Ch1.param1;
                //obj->dma0ChX.paramX = udbDma0Ch1paramX;
                cy_hwmgr_set_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
            }
        }
    }
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        /* Reserve DMA1 CH1 */
        cy_resource_inst_t dmaRsc = { CY_RSC_DMA, 1, 1 };
        retVal = cy_hwmgr_reserve(&dmaRsc);

        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num, &isConfigured);

            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                //cy_dma_t udbDma1Ch1 = {TODO fill when is ready};

                /* Update obj info related to DMA */
                //obj->dma0Ch1.param1 = udbDma1Ch1.param1;
                //obj->dma0ChX.paramX = udbDma1Ch1paramX;
                cy_hwmgr_set_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
            }
        }
    }
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        /* Reserve DMA1 CH3 */
        cy_resource_inst_t dmaRsc = { CY_RSC_DMA, 1, 3 };
        retVal = cy_hwmgr_reserve(&dmaRsc);

        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num, &isConfigured);
            
