dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_udb_sdio.c
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                cy_hwmgr_set_configured(dmaRsc.type, dmaRsc.block_num, dmaRsc.channel_num);
            }
        }
    }

    /* Reserve the clk pin */
    if (retVal == CY_RSLT_SUCCESS)
    {
        cy_resource_inst_t pinRsc = cy_utils_get_gpio_resource(clk);
        retVal = cy_hwmgr_reserve(&pinRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num, &isConfigured);
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                Cy_GPIO_Pin_Init(CY_GET_PORTADDR(clk), CY_GET_PIN(clk), &pin_clk_config);

                obj->pin_clk = clk;

                cy_hwmgr_set_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num);
            }
        }
    }

    /* Reserve the cmd pin */
    if (retVal == CY_RSLT_SUCCESS)
    {
        cy_resource_inst_t pinRsc = cy_utils_get_gpio_resource(cmd);
        retVal = cy_hwmgr_reserve(&pinRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num, &isConfigured);
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                Cy_GPIO_Pin_Init(CY_GET_PORTADDR(cmd), CY_GET_PIN(cmd), &pin_cmd_config);

                obj->pin_cmd = cmd;

                cy_hwmgr_set_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num);
            }
        }
    }

    /* Reserve the data0 pin */
    if (retVal == CY_RSLT_SUCCESS)
    {
        cy_resource_inst_t pinRsc = cy_utils_get_gpio_resource(data0);
        retVal = cy_hwmgr_reserve(&pinRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num, &isConfigured);
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                Cy_GPIO_Pin_Init(CY_GET_PORTADDR(data0), CY_GET_PIN(data0), &pin_data_config);

                obj->pin_data0 = data0;

                cy_hwmgr_set_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num);
            }
        }
    }
    
    /* Reserve the data1 pin */
    if (retVal == CY_RSLT_SUCCESS)
    {
        cy_resource_inst_t pinRsc = cy_utils_get_gpio_resource(data1);
        retVal = cy_hwmgr_reserve(&pinRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num, &isConfigured);
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                Cy_GPIO_Pin_Init(CY_GET_PORTADDR(data1), CY_GET_PIN(data1), &pin_data_config);

                obj->pin_data1 = data1;
                cy_hwmgr_set_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num);
            }
        }
    }
    
    /* Reserve the data2 pin */
    if (retVal == CY_RSLT_SUCCESS)
    {
        cy_resource_inst_t pinRsc = cy_utils_get_gpio_resource(data2);
        retVal = cy_hwmgr_reserve(&pinRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num, &isConfigured);
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                Cy_GPIO_Pin_Init(CY_GET_PORTADDR(data2), CY_GET_PIN(data2), &pin_data_config);

                obj->pin_data2 = data2;
                cy_hwmgr_set_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num);
            }
        }
    }
    
    /* Reserve the data3 pin */
    if (retVal == CY_RSLT_SUCCESS)
    {
        cy_resource_inst_t pinRsc = cy_utils_get_gpio_resource(data3);
        retVal = cy_hwmgr_reserve(&pinRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            retVal = cy_hwmgr_is_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num, &isConfigured);
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                Cy_GPIO_Pin_Init(CY_GET_PORTADDR(data3), CY_GET_PIN(data3), &pin_data_config);

                obj->pin_data3 = data3;
                cy_hwmgr_set_configured(pinRsc.type, pinRsc.block_num, pinRsc.channel_num);
            }
        }
    }
    
    /* Reserve UDB */
    if (retVal == CY_RSLT_SUCCESS)
    {
        /* UDB SDIO resource */
        cy_resource_inst_t udbRsc = { CY_RSC_UDB, 0, 0 };
    
        retVal = cy_hwmgr_reserve(&udbRsc);
        if (retVal == CY_RSLT_SUCCESS)
        {
            /* Check is the UDB configured */
            retVal = cy_hwmgr_is_configured(udbRsc.type, udbRsc.block_num, udbRsc.channel_num, &isConfigured);
            if (retVal == CY_RSLT_SUCCESS && !isConfigured)
            {
                /* Update SDIO object */
                obj->resource.type = udbRsc.type;
                obj->resource.block_num = udbRsc.block_num;
                obj->resource.channel_num = udbRsc.channel_num;

                SDIO_Init((stc_sdio_irq_cb_t *) &cy_sdio_interrupts_dispatcher_IRQHandler);
                
                /* Register two DMA interrupt handler functions 
                *  TODO: 
                *  1. Need to do this in the DMA hal (once it is implemented)
                *  2. Figure out how to aware rtoses about these handler executions.
                *
                *   __asm__( "PUSH {lr}" ); 
                *   __asm__( "bl _tx_thread_context_save" );
                *   handler(); \
                *   __asm__( "b  _tx_thread_context_restore" ); 
                *  ...
                */
                
                    /* Set default interrupt priority of 7 (lowest possible priority) */
                cy_stc_sysint_t irqCfg = {udb_interrupts_0_IRQn, 7};
                Cy_SysInt_Init(&irqCfg, &SDIO_IRQ);
                NVIC_EnableIRQ(udb_interrupts_0_IRQn);
                
                /* Setup write DMA interrupt handler */
                cy_stc_sysint_t irqDma1_1 = {cpuss_interrupts_dw1_1_IRQn, 7};
                Cy_SysInt_Init(&irqDma1_1, &SDIO_WRITE_DMA_IRQ);
                NVIC_EnableIRQ(cpuss_interrupts_dw1_1_IRQn);
                
                /* Setup read DMA interrupt handler */
                cy_stc_sysint_t irqDma1_3 = {cpuss_interrupts_dw1_3_IRQn, 7};
                Cy_SysInt_Init(&irqDma1_3, &SDIO_READ_DMA_IRQ);
                NVIC_EnableIRQ(cpuss_interrupts_dw1_3_IRQn);

                obj->frequency_hz = 400000U;        /* SDIO_Init() configures the SDIO to 40 kHz */
                obj->block_size   = CY_HAL_SDIO_64B;
                
