dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_udb_sdio.c
                /* Connect UDB to DMA */
                Cy_TrigMux_Connect(TRIG0_IN_TR_GROUP14_OUTPUT1, TRIG0_OUT_CPUSS_DW0_TR_IN1, false, TRIGGER_TYPE_LEVEL);
                Cy_TrigMux_Connect(TRIG0_IN_TR_GROUP14_OUTPUT4, TRIG0_OUT_CPUSS_DW0_TR_IN0, false, TRIGGER_TYPE_LEVEL);
                Cy_TrigMux_Connect(TRIG1_IN_TR_GROUP14_OUTPUT0, TRIG1_OUT_CPUSS_DW1_TR_IN1, false, TRIGGER_TYPE_LEVEL);
                Cy_TrigMux_Connect(TRIG1_IN_TR_GROUP14_OUTPUT5, TRIG1_OUT_CPUSS_DW1_TR_IN3, false, TRIGGER_TYPE_LEVEL);
                
                Cy_TrigMux_Connect(TRIG14_IN_UDB_TR_UDB0, TRIG14_OUT_TR_GROUP1_INPUT43, false, TRIGGER_TYPE_LEVEL);
                Cy_TrigMux_Connect(TRIG14_IN_UDB_TR_UDB1, TRIG14_OUT_TR_GROUP0_INPUT44, false, TRIGGER_TYPE_LEVEL);
                Cy_TrigMux_Connect(TRIG14_IN_UDB_TR_UDB3, TRIG14_OUT_TR_GROUP0_INPUT47, false, TRIGGER_TYPE_LEVEL);
                Cy_TrigMux_Connect(TRIG14_IN_UDB_TR_UDB7, TRIG14_OUT_TR_GROUP1_INPUT48, false, TRIGGER_TYPE_LEVEL);
                
                retVal = cy_hwmgr_set_configured(udbRsc.type, udbRsc.block_num, udbRsc.channel_num);
            }
        }
    }

    if (retVal != CY_RSLT_SUCCESS)
    {
        cy_sdio_free(obj);
    }

    return retVal;
}


/** Release the SDIO peripheral, not currently invoked. It requires further
 *  resource management.
 *
 * @param[in,out] obj The SDIO object
 * @return The status of the free request
 */
cy_rslt_t cy_sdio_free(cy_sdio_t *obj)
{
    cy_rslt_t retVal;
    
    if (NULL == obj)
    {
        return CY_RSLT_SDIO_BAD_PARAM_ARGUMENT;
    }
    
    retVal = cy_free_pins(obj);

    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_free_clocks(obj);
    }
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        retVal = cy_free_dmas(obj);
    }
    
    if (retVal == CY_RSLT_SUCCESS)
    {
        /* All other resources were released so need to release UDB resource */
        retVal = cy_hwmgr_set_unconfigured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);
    }

    return retVal;
}

/** Configure the SDIO block.
 *
 * @param[in,out] obj    The SDIO object
 * @param[in]     config The SDIO configuration to apply
 * @return The status of the configure request
 */
cy_rslt_t cy_sdio_configure(cy_sdio_t *obj, const cy_sdio_cfg_t *config)
{
    if (NULL == obj)
    {
        return CY_RSLT_SDIO_BAD_PARAM_ARGUMENT;
    }

    SDIO_SetSdClkFrequency(config->frequency_hz);
    SDIO_SetBlockSize(config->block_size);

    obj->frequency_hz = config->frequency_hz;
    obj->block_size   = config->block_size;
    
    return CY_RSLT_SUCCESS;
}

/** Sends a command to the SDIO block.
 *
 * @param[in,out] obj       The SDIO object
 * @param[in]     direction The direction of transfer (read/write)
 * @param[in]     command   The SDIO command to send
 * @param[in]     argument  The argument to the command
 * @param[out]    response  The response from the SDIO device
 * @return The status of the configure request
 */
cy_rslt_t cy_sdio_send_cmd(const cy_sdio_t *obj, cy_transfer_t direction, cy_sdio_command_t command, uint32_t argument, uint32_t* response)
{
    if ((NULL == obj) && (command == SDIO_CMD_IO_RW_EXTENDED))
    {
        return CY_RSLT_SDIO_BAD_PARAM_ARGUMENT;
    }

    if (response != NULL)
    {
        *response = 0;
    }
    
    stc_sdio_cmd_t cmd;
    en_sdio_result_t status;
    cy_rslt_t retVal = CY_RSLT_SUCCESS;

    cmd.u32CmdIdx = (uint32_t) command;
    cmd.u32Arg = argument;
    cmd.pu32Response = response;
    cmd.pu8Data = NULL;               /* Not used */
    cmd.bRead = (direction != CY_READ) ? false : true;
    cmd.u16BlockCnt = 0U;            /* Not used */
    cmd.u16BlockSize = 0U;          /* Not used */

    status = SDIO_SendCommandAndWait(&cmd);

    if (Ok != status)
    {
        /* Return values are mapped on defines located in the hal sdio header */
        retVal = CY_RSLT_SDIO_FUNC_RET_ERROR(status);
    }

    return retVal;
}


/** Performs a bulk data transfer (CMD=53) to the SDIO block.
 *
 * @param[in,out] obj       The SDIO object
 * @param[in]     direction The direction of transfer (read/write)
 * @param[in]     argument  The argument to the command
 * @param[in]     data      The data to send to the SDIO device
 * @param[in]     length    The number of bytes to send
 * @param[out]    response  The response from the SDIO device
 * @return The status of the configure request
 */
cy_rslt_t cy_sdio_bulk_transfer(cy_sdio_t *obj, cy_transfer_t direction, uint32_t argument, const uint32_t* data, uint16_t length, uint32_t* response)
{
    if (NULL == obj)
    {
        return CY_RSLT_SDIO_BAD_PARAM_ARGUMENT;
    }

    stc_sdio_cmd_t cmd;
    en_sdio_result_t status;
    cy_rslt_t retVal;

    cmd.u32CmdIdx = (uint32_t) SDIO_CMD_IO_RW_EXTENDED;
    cmd.u32Arg = argument;
    cmd.pu32Response = response;
    cmd.pu8Data = (uint8_t *) data;
    cmd.bRead = (direction != CY_READ) ? false : true;

    if (length >= CY_HAL_SDIO_64B)
    {
        cmd.u16BlockCnt = (uint16_t) ((length + CY_HAL_SDIO_64B - 1)/CY_HAL_SDIO_64B);
        cmd.u16BlockSize = CY_HAL_SDIO_64B; 

        /* Update object info */
        obj->block_size = CY_HAL_SDIO_64B;
    }
    else
    {
        /* Data will be sent as one packet */
        cmd.u16BlockCnt = CY_HAL_SDIO_1B;
        cmd.u16BlockSize = length;
        
        /* Update object info */
        obj->block_size = length;
    }

    status = SDIO_SendCommandAndWait(&cmd);

    if (Ok != status)
    {
        /* return values are mapped on defines located in the hal sdio header */
        retVal = CY_RSLT_SDIO_FUNC_RET_ERROR(status);
    }
    else
    {
        retVal = CY_RSLT_SUCCESS;
    }

    return retVal;
}

/** Performs a bulk asynchronus data transfer (CMD=53) to the SDIO block.
 *
 * @param[in,out] obj       The SDIO object
 * @param[in]     direction The direction of transfer (read/write)
 * @param[in]     argument  The argument to the command
 * @param[in]     data      The data to send to the SDIO device
 * @param[in]     length    The number of bytes to send
 * @return The status of the configure request
 */
cy_rslt_t cy_sdio_transfer_async(cy_sdio_t *obj, cy_transfer_t direction, uint32_t argument, const uint32_t* data, uint16_t length)
{
    if (NULL == obj)
    {
        return CY_RSLT_SDIO_BAD_PARAM_ARGUMENT;
    }

    stc_sdio_cmd_t cmd;
    en_sdio_result_t status;
    cy_rslt_t retVal;

    cmd.u32CmdIdx = (uint32_t) SDIO_CMD_IO_RW_EXTENDED;
    cmd.u32Arg = argument;
    cmd.pu32Response = NULL;
    cmd.pu8Data = (uint8_t *) data;
    cmd.bRead = (direction != CY_READ) ? false : true;

    if (length >= CY_HAL_SDIO_64B)
    {
        cmd.u16BlockCnt = (uint16_t) ((length + CY_HAL_SDIO_64B - 1)/CY_HAL_SDIO_64B);
        cmd.u16BlockSize = CY_HAL_SDIO_64B; 

        /* Update object info */
        obj->block_size = CY_HAL_SDIO_64B;
    }
    else
    {
        /* Data will be sent as one packet */
        cmd.u16BlockCnt = CY_HAL_SDIO_1B;
        cmd.u16BlockSize = length;
        
        /* Update object info */
        obj->block_size = length;
    }

    status = SDIO_SendCommandAndWait(&cmd);

    if (Ok != status)
    {
        /* return values are mapped on defines located in the hal sdio header */
        retVal = CY_RSLT_SDIO_FUNC_RET_ERROR(status);
    }
    else
    {
        retVal = CY_RSLT_SUCCESS;
    }

    return retVal;
}


