dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_udb_sdio.c
/** Checks if the specified SDIO is in use
 *
 * @param[in]  obj  The SDIO peripheral to check
 * @param[out] busy Indication of whether the SDIO is still transmitting
 * @return The status of the is_busy request
 */
cy_rslt_t cy_sdio_is_busy(const cy_sdio_t *obj, bool *busy)
{
    if (obj == NULL)
    {
        return CY_RSLT_SDIO_BAD_PARAM_ARGUMENT;
    }
    
    en_sdio_result_t retVal = SDIO_GetSemaphoreStatus(busy);

    return ((Ok != retVal) ? CY_RSLT_SDIO_SEMA_NOT_INITED : CY_RSLT_SUCCESS);
}

/** Abort an SDIO transfer
 *
 * @param[in] obj The SDIO peripheral to stop. Resets UDB block
 * @return The status of the abort_async request
 */
cy_rslt_t cy_sdio_abort_async(const cy_sdio_t *obj)
{
    /* Reset UDB SDIO */
    SDIO_Reset();
    return CY_RSLT_SUCCESS;
}

/** The sdio interrupt handler registration
 *
 * @param[in] obj         The SDIO object
 * @param[in] handler     The callback handler which will be invoked when the interrupt fires
 * @param[in] handler_arg Generic argument that will be provided to the handler when called
 * @return The status of the register_irq request
 */
cy_rslt_t cy_sdio_register_irq(cy_sdio_t *obj, cy_sdio_irq_handler handler, void *handler_arg)
{
    cy_hal_sdio_config_struct = obj;
    cy_hal_sdio_callback = handler;
    cy_hal_sdio_callback_args = handler_arg;

    return CY_RSLT_SUCCESS;
}

/** Configure SDIO interrupt.
 *
 * @param[in] obj      The SDIO object
 * @param[in] event    The SDIO IRQ type
 * @param[in] enable   Set to non-zero to enable events, or zero to disable them
 * @return The status of the irq_enable request
 */
cy_rslt_t cy_sdio_irq_enable(cy_sdio_t *obj, cy_sdio_irq_event_t event, bool enable)
{
    if (enable)
    {
        obj->irqCause |= event;
        
        if (cy_hal_sdio_config_struct != NULL)
        {
            cy_hal_sdio_config_struct->irqCause |= event;
        }
        
        SDIO_EnableChipInt();
    }
    else
    {
        obj->irqCause &= ~event;

        if (cy_hal_sdio_config_struct != NULL)
        {
            cy_hal_sdio_config_struct->irqCause &= ~event;
        }
        
        SDIO_DisableChipInt();
    }
    return CY_RSLT_SUCCESS;
}


#endif /* defined(CY8C6247BZI_D54) */
